## Pandas

In [97]:
import pandas as pd

In [98]:
students_records = {'Roll no':[1,2,3,4,5],'Names':['Rohan','Rohit','Sam','Ankit','Arpit'],'subjects':['Java','python','c++','python','ruby'],'Marks':[95,97,45,68,77]}

In [99]:
students_records

{'Roll no': [1, 2, 3, 4, 5],
 'Names': ['Rohan', 'Rohit', 'Sam', 'Ankit', 'Arpit'],
 'subjects': ['Java', 'python', 'c++', 'python', 'ruby'],
 'Marks': [95, 97, 45, 68, 77]}

In [100]:
df=pd.DataFrame(students_records)

In [101]:
df #tabuler format

   Roll no  Names subjects  Marks
0        1  Rohan     Java     95
1        2  Rohit   python     97
2        3    Sam      c++     45
3        4  Ankit   python     68
4        5  Arpit     ruby     77

In [102]:
df['Names']

0    Rohan
1    Rohit
2      Sam
3    Ankit
4    Arpit
Name: Names, dtype: object

In [103]:
type(df)

pandas.core.frame.DataFrame

In [104]:
df.size

20

In [105]:
df.ndim #dimension

2

In [25]:
df.dtypes #data types

Roll no      int64
Names       object
subjects    object
Marks        int64
dtype: object

## pandas SQL

In [33]:
df['Marks'].max()

97

In [34]:
df['Names'][df['Marks']==df['Marks'].max()]

1    Rohit
Name: Names, dtype: object

In [36]:
df['Names'][df['Marks']>70]

0    Rohan
1    Rohit
4    Arpit
Name: Names, dtype: object

In [40]:
df[['Names','subjects','Marks']][df['Marks']==df['Marks'].max()]

   Names subjects  Marks
1  Rohit   python     97

In [41]:
df[:][df['Marks']==df['Marks'].max()]

   Roll no  Names subjects  Marks
1        2  Rohit   python     97

In [42]:
df[df['Marks']==df['Marks'].max()]

   Roll no  Names subjects  Marks
1        2  Rohit   python     97

In [43]:
df['Marks'].mean()

76.4

In [44]:
df['Marks'].median()

77.0

In [47]:
import numpy as np
students_record= {'Roll no':[1,2,3,4,5],'Names':['Rohan','Rohit','Sam','Ankit','Arpit'],'Subjects' :['java','Python','c++','Python','Ruby'],'Marks' :[95,97,np.nan,68,77]}

In [48]:
students_records

{'Roll no': [1, 2, 3, 4, 5],
 'Names': ['Rohan', 'Rohit', 'Sam', 'Ankit', 'Arpit'],
 'subjects': ['Java', 'python', 'c++', 'python', 'ruby'],
 'Marks': [95, 97, 45, 68, 77]}

In [51]:
df = pd.DataFrame(students_record)

In [53]:
df

   Roll no  Names Subjects  Marks
0        1  Rohan     java   95.0
1        2  Rohit   Python   97.0
2        3    Sam      c++    NaN
3        4  Ankit   Python   68.0
4        5  Arpit     Ruby   77.0

In [55]:
df=pd.read_csv('Min_Max_Seasonal.csv')

In [56]:
df

,YEAR,ANNUAL - MIN,ANNUAL - MAX,JAN-FEB - MIN,JAN-FEB - MAX,MAR-MAY - MIN,MAR-MAY - MAX,JUN-SEP - MIN,JUN-SEP - MAX,OCT-DEC - MIN,OCT-DEC - MAX
0,2000,19.48,29.75,13.84,24.82,20.77,32.22,23.25,31.25,16.88,28.53
1,2001,19.49,29.99,13.60,25.88,21.04,32.61,23.36,31.62,16.95,28.13
2,2002,19.78,30.23,13.93,25.37,21.38,33.06,23.41,32.02,16.79,28.36
3,2003,19.70,29.75,14.32,25.32,21.00,32.05,23.56,31.72,16.76,27.70
4,2004,19.69,29.79,14.39,25.47,21.30,32.69,23.27,31.42,16.84,27.65
5,2005,19.58,29.60,14.63,24.96,20.85,31.81,23.46,31.84,16.43,27.50
6,2006,20.07,30.06,15.47,27.44,20.96,32.08,23.44,31.39,17.56,27.78
7,2007,19.69,29.84,14.47,25.73,21.06,32.32,23.59,31.40,16.62,28.03
8,2008,19.60,29.64,13.60,24.72,20.82,32.11,23.30,31.25,17.43,28.29
9,2009,19.94,30.30,14.95,26.51,21.15,32.57,23.59,32.24,17.20,27.96
10,2010,20.15,30.13,14.51,25.96,22.09,33.47,23.57,31.43,17.42,27.78
11,2011,19.58,29.82,13.84,25.33,20.68,32.07,23.56,31.55,17.16,28.23
12,2012,19.54,29.81,13.68,25.03,20.78,32.33,23.68,31.77,16.80,27.88
13,2013,19.83,29.81,14.38,25.58,21.14,32.58,23.61,31.33,16.82,27.83
14,2014,19.77,29.72,14.26,24.90,20.66,31.82,23.80,32.00,17.20,27.81
15,2015,19.96,29.90,14.53,25.74,20.91,31.68,23.62,31.87,17.75,28.27
16,2016,21.28,31.63,16.17,28.33,23.15,34.57,24.61,32.28,18.37,30.03

In [57]:
type(df)

pandas.core.frame.DataFrame

In [58]:
df.size

187

In [59]:
df.ndim

2

In [65]:
df['JAN-FEB - MAX'].max()

28.33

In [71]:
df['YEAR'][df['ANNUAL - MIN'] ==df['ANNUAL - MIN'].max()]

16    2016
Name: YEAR, dtype: int64

In [72]:
## creating Dataframe using list of tuples

In [73]:
students_records = [(1,'Rohit'),(2,'Rohan')]
students_records

[(1, 'Rohit'), (2, 'Rohan')]

In [77]:
df=pd.DataFrame(students_records,columns=['RollNo','Names'])

In [78]:
df

   RollNo  Names
0       1  Rohit
1       2  Rohan

## creating Dataframe using list of list

In [81]:
students_records = [[1,'Rohit'],[2,'Rohan']]
students_records

[[1, 'Rohit'], [2, 'Rohan']]

In [83]:
df =pd.DataFrame(students_records,columns=['RollNo','Names'])

In [84]:
df

   RollNo  Names
0       1  Rohit
1       2  Rohan

In [91]:
## creating datframe using list of dict

In [92]:
students_records = [{'Roll no': 1,'Namees' :'Rohan'},
                    {'Roll no': 2,'Namees' :'Rohit'},
                   {'Roll no': 3,'Namees' :'Sam'}
                   ]

In [93]:
students_records

[{'Roll no': 1, 'Namees': 'Rohan'},
 {'Roll no': 2, 'Namees': 'Rohit'},
 {'Roll no': 3, 'Namees': 'Sam'}]

In [94]:
df=pd.DataFrame(students_records)

In [90]:
df

  Namees  Roll no
0  Rohan        1
1  Rohit        2
2    Sam        3